DataProcessors/ЗагрузкаКурсовВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<DataProcessor>
		<Properties>
			<Name>ЗагрузкаКурсовВалют</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНач</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаКон</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

InformationRegisters/КурсыВалют.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалют</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

DataProcessors/ЗагрузкаКурсовВалют/Forms/ФормаЗагрузкаКурсовВалютЦБР/Ext/Form/Module.bsl
&НаСервере
Процедура ЗагрузитьКурсыНаСервере()
	// Проверка заполнения дат	
	Если Не ЗначениеЗаполнено(Объект.ДатаНач) Тогда
	    Сообщить("Не указана Дата начала!");
	    Возврат;
	ИначеЕсли Не ЗначениеЗаполнено(Объект.ДатаКон) Тогда
	    Сообщить("Не указана Дата окончания!");
	    Возврат;
	ИначеЕсли Объект.ДатаНач > Объект.ДатаКон Тогда
	    Сообщить("Неверный диапазон дат!");
	    Возврат;
	ИначеЕсли Объект.ДатаКон > ТекущаяДата() Тогда
	    Сообщить("Обратите внимание! Дата окончания больше текущей");
	КонецЕсли;

	ТекущаяДата = Объект.ДатаНач;
	КолНовыхЗаписей = 0;
    КолОбнЗаписей = 0;

	// HTTP-соединение создаём один раз до цикла
	Защита = Новый ЗащищенноеСоединениеOpenSSL();
	Соединение = Новый HTTPСоединение("www.cbr.ru", 443,,,,, Защита);

	Пока ТекущаяДата <= Объект.ДатаКон Цикл

	    // 1. Запрос к ЦБ
	    АдресРесурса = "/scripts/XML_daily.asp?date_req=" + Формат(ТекущаяДата, "ДФ=dd/MM/yyyy");
	    Запрос = Новый HTTPЗапрос(АдресРесурса);

	    Попытка
	        Ответ = Соединение.Получить(Запрос);
	    Исключение
	        Сообщить("Ошибка подключения к серверу ЦБ: " + ОписаниеОшибки());
	        Возврат;
	    КонецПопытки;

	    Если Ответ.КодСостояния <> 200 Тогда
	        Сообщить("Ошибка сервера: " + Ответ.КодСостояния);
	        ТекущаяДата = ТекущаяДата + 86400;
	        Продолжить;
	    КонецЕсли;

	    // 2. Парсинг XML — собираем все курсы за день в соответствие
	    ЧтениеXML = Новый ЧтениеXML;
	    ЧтениеXML.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());

	    // Проверка даты в ValCurs
	    ДатаИзXML = '00010101';
	    Пока ЧтениеXML.Прочитать() Цикл
	        Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "ValCurs" Тогда
	            ДатаСтрока = ЧтениеXML.ПолучитьАтрибут("Date");
	            Если ЗначениеЗаполнено(ДатаСтрока) Тогда
					ДатаИзXML = РаботаСДокументамиСервер.СтрокаВДату(ДатаСтрока);
	            КонецЕсли;
	            Прервать; // выходим, атрибут прочитан
	        КонецЕсли;
	    КонецЦикла;

	    // Если дата из XML не совпадает с запрошенной — пропускаем
	    Если ДатаИзXML <> ТекущаяДата Тогда
	        ЧтениеXML.Закрыть();
	        ТекущаяДата = ТекущаяДата + 86400;  // Добавляем день к текущей дате
	        Продолжить;
	    КонецЕсли;

		
	    КурсыЗаДень = Новый Соответствие; // Ключ: СсылкаВалюта, Значение: Структура(Курс, Кратность)

	    Пока ЧтениеXML.Прочитать() Цикл

	        Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента И ЧтениеXML.Имя = "Valute" Тогда

	            ТекКод = "";
	            ТекКурс = 0;
	            ТекНоминал = 1;

	            Пока ЧтениеXML.Прочитать() Цикл
	                Если ЧтениеXML.ТипУзла = ТипУзлаXML.КонецЭлемента И ЧтениеXML.Имя = "Valute" Тогда
	                    Прервать;
	                КонецЕсли;

	                Если ЧтениеXML.ТипУзла = ТипУзлаXML.НачалоЭлемента Тогда
	                    ИмяУзла = ЧтениеXML.Имя;
	                    ЧтениеXML.Прочитать();

	                    Если ИмяУзла = "NumCode" Тогда
	                        ТекКод = ЧтениеXML.Значение;
	                    ИначеЕсли ИмяУзла = "Nominal" Тогда
	                        ТекНоминал = Число(СтрЗаменить(ЧтениеXML.Значение, ",", "."));
	                    ИначеЕсли ИмяУзла = "Value" Тогда
	                        ТекКурс = Число(СтрЗаменить(ЧтениеXML.Значение, ",", "."));
	                    КонецЕсли;
	                КонецЕсли;
	            КонецЦикла;

	            // 3. Фильтр по валюте и поиск ссылки
	            Если ЗначениеЗаполнено(ТекКод) Тогда
	                Если (Не ЗначениеЗаполнено(Объект.Валюта)) Или (Объект.Валюта.Код = ТекКод) Тогда
	                    СсылкаВалюта = Справочники.Валюты.НайтиПоКоду(ТекКод);
	                    Если Не СсылкаВалюта.Пустая() Тогда
	                        КурсыЗаДень.Вставить(СсылкаВалюта, Новый Структура("Курс, Кратность", ТекКурс, ТекНоминал));
	                    КонецЕсли;
	                КонецЕсли;
	            КонецЕсли;

	        КонецЕсли;
	    КонецЦикла;

	    ЧтениеXML.Закрыть();

	    // 4. Запись в регистр через НаборЗаписей — один набор на валюту
	    Для Каждого ЭлементКурса Из КурсыЗаДень Цикл
	        СсылкаВалюта = ЭлементКурса.Ключ;
	        ДанныеКурса = ЭлементКурса.Значение;

	        НаборЗаписей = РегистрыСведений.КурсыВалют.СоздатьНаборЗаписей();
	        НаборЗаписей.Отбор.Валюта.Установить(СсылкаВалюта);
	        НаборЗаписей.Прочитать();

	        // Ищем запись за текущую дату
	        ЗаписьНайдена = Ложь;
	        Для Каждого Запись Из НаборЗаписей Цикл
	            Если Запись.Период = ТекущаяДата Тогда
	                Запись.Курс = ДанныеКурса.Курс;
	                Запись.Кратность = ДанныеКурса.Кратность;
	                ЗаписьНайдена = Истина;
					КолОбнЗаписей = КолОбнЗаписей + 1;
	                Прервать;
	            КонецЕсли;
	        КонецЦикла;

	        // Если записи нет — добавляем
	        Если Не ЗаписьНайдена Тогда
	            НоваяЗапись = НаборЗаписей.Добавить();
	            НоваяЗапись.Период = ТекущаяДата;
	            НоваяЗапись.Валюта = СсылкаВалюта;
	            НоваяЗапись.Курс = ДанныеКурса.Курс;
	            НоваяЗапись.Кратность = ДанныеКурса.Кратность;
		        КолНовыхЗаписей = КолНовыхЗаписей + 1;
	        КонецЕсли;

	        НаборЗаписей.Записать();
	    КонецЦикла;

	    ТекущаяДата = ТекущаяДата + 86400;
	КонецЦикла;

	Если КолНовыхЗаписей + КолОбнЗаписей > 0 Тогда
	    Сообщить("Загрузка завершена. Записано в регистр ""Курсы валют"" новых: " + КолНовыхЗаписей + ". Обновлено: " + КолОбнЗаписей);
	Иначе
	    Сообщить("Записи в регистр ""Курсы валют"" за указанные даты отсутствуют");
	КонецЕсли;
 
КонецПроцедуры

//&НаКлиенте
//Процедура ЗагрузитьКурсы(Команда)
//	ПЕРЕМ Отказ;
//	
//	Отказ = ЛОЖЬ;
//	ЗагрузитьКурсыНаСервере();
//	РаботаСДокументамиКлиент.ЗадатьПроизвольныйВопросПользователю("Открыть регистр ""Курсы валют""",Отказ);
//	Если Отказ Тогда
//		Возврат;
//	КонецЕсли;
//    Оповестить("ОбновитьКурсыВалют");

//	ОткрытьФорму("РегистрСведений.КурсыВалют.ФормаСписка");
//КонецПроцедуры

&НаКлиенте
Процедура ЗагрузитьКурсы(Команда)
	
	ЗагрузитьКурсыНаСервере();
	
	Обработчик = Новый ОписаниеОповещения("ПослеВопросаОткрытьРегистр", ЭтотОбъект);
	
	РаботаСДокументамиКлиент.ЗадатьПроизвольныйВопросПользователю(
		"Открыть регистр ""Курсы валют""?",
		,
		Обработчик);
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеВопросаОткрытьРегистр(Параметр1,Параметр2) Экспорт
	Оповестить("ОбновитьКурсыВалют");
	ОткрытьФорму("РегистрСведений.КурсыВалют.ФормаСписка");
КонецПроцедуры

&НаКлиенте
Процедура ПриИзменении(Элемент)
	Если Объект.ДатаКон < Объект.ДатаНач Тогда
		Объект.ДатаКон=Объект.ДатаНач;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Объект.ДатаНач = ТекущаяДата();
	Объект.ДатаКон = Объект.ДатаНач;
КонецПроцедуры

&НаКлиенте
Процедура ДатаКонПриИзменении(Элемент)
	Если Объект.ДатаКон > ТекущаяДата() Тогда
		Объект.ДатаКон = ТекущаяДата();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыборПериода(Команда)
	
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("НачалоПериода", Объект.ДатаНач);
	ПараметрыВыбора.Вставить("КонецПериода", Объект.ДатаКон);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборПериода", ПараметрыВыбора, Элементы.ВыборПериода, , , , ОписаниеОповещения);

КонецПроцедуры   

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	ЗаполнитьЗначенияСвойств(Объект, РезультатВыбора, "ДатаНач,ДатаКон");

КонецПроцедуры
